Maestro/blog/app/controllers/events_controller.rb

	def index
		no_user and return
		@events = Event.where(user_id: current_user.id)
---
SELECT  "events".* FROM "events" WHERE "events"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

	def show
		no_user and return
		@event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		no_user and return
		@event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		no_user and return
 		@event = Event.new(event_params)
 		@event.user_id = current_user.id

 		if @event.save
---
INSERT INTO "events" ("name", "description", "street_address", "apartment_number", "city", "date", "password", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "test1"], ["description", ""], ["street_address", ""], ["apartment_number", 0], ["city", ""], ["date", "2111-11-11"], ["password", "123456"], ["user_id", 1]]

	def update
		no_user and return
		@event = Event.find(params[:id])
		is_user_invalid(@event) and return

		if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "street_address" = ?, "city" = ?, "password" = ? WHERE "events"."id" = ?  [["description", ""], ["street_address", ""], ["city", ""], ["password", "123456"], ["id", 15]]

	def destroy
		no_user and return
		@event = Event.find(params[:id])
		is_user_invalid(@event) and return
		@event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]

	def display
		no_user and return
		@event = Event.find(params[:event_id])
		is_user_invalid(@event) and return
		@guests = Guest.where(event_id = params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "guests".* FROM "guests" WHERE (16)

	def add
		no_user and return
		@event = Event.find(params[:event_id])
		is_user_invalid(@event) and return
		@user = User.find(@event.user_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def make
		no_user and return
		@event = Event.new(event_params)
		#Rails.logger.event.debug("\nEvent user id: <#{@event.user_id}>.\n")
		is_user_invalid(@event) and return
		#Add guests that aren't in the list. Add user accounts for new guests. Remove users with _delete = true.
		@event.guests.each do |guest|
			#Check if user with same email as guest is in database. If it isn't, add it.
			@user_in_database = User.find_by email: guest.email
			if (@user_in_database.nil?) # if user is not in the database (unique email check)
				# create a new user
				@user = User.new
				@user.first_name = guest.first_name
				@user.last_name = guest.last_name
				@user.email = guest.email
				@user.password = SecureRandom.base64
				@user.password_confirmation = @user.password
				@user.save
			end
			#Check if guest record is in database. If it isn't, add it.
			@guest_in_database = Guest.find_by email: guest.email, event_id: @event.id
---
SELECT "guests".* FROM "guests" WHERE "guests"."event_id" IS NULL
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Test10@test.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "guests".* FROM "guests" WHERE "guests"."email" = ? AND "guests"."event_id" IS NULL LIMIT ?  [["email", ""], ["LIMIT", 1]]