Maestro/blog/app/controllers/registrations_controller.rb

  def destroy
		@events = Event.where(user_id: resource.id)
		@events.each do |event|
			@event_joins = EventUser.where(event_id: event.id)
			@event_joins.each do |join|
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 5]]
SELECT "event_users".* FROM "event_users" WHERE "event_users"."event_id" = ?  [["event_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]