Maestro/blog/app/controllers/users_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def create
		@event = Event.find(params[:event_id])