Maestro/blog/app/controllers/users_controller.rb

SELECT "users".* FROM "users" INNER JOIN events_users ON events_users.user_id = users.id AND events_users.event_id = 3
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def display
		@users = User.joins("INNER JOIN event_users ON event_users.user_id = users.id AND event_users.event_id = #{params[:event_id]}")
		@event = Event.find(params[:event_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "event_users" ON "users"."id" = "event_users"."user_id" WHERE "event_users"."event_id" = ?  [["event_id", 4]]
---
	def new
		@users = User.new
		@event = Event.find(params[:event_id])
		@owner = User.find(@event.user_id)

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test3@test.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		Rails.logger.event.debug("===New Create===\n")
		@user_check = true;

		#@event = Event.new(event_params)
		@event = Event.new(event_user_params)

		@event.users.each do |user|
			user.password = SecureRandom.base64
			user.password_confirmation = user.password
			#test all saves here
			if(!user.try(:save))
				user_check = false;
			end
		end
		Rails.logger.event.debug("Can we save all users: #{@user_check}. If true, continue.")
		if(@user_check)
			#add all saves here
			#add all associations here
			@event.users.each do |user|
				@user_in_database = User.find_by email: user.email
				Rails.logger.event.debug("User in database check. Id: #{@user_in_database.id}. Email: #{@user_in_database.email}.")
				if (@user_in_database.nil?) # if user is not in the database (unique email check)
					# create a new user
					User.transaction do
						user.save

INSERT INTO "event_users" ("event_id", "user_id") VALUES (?, ?)  [["event_id", 4], ["user_id", 10]]
SELECT  "event_users".* FROM "event_users" WHERE "event_users"."user_id" = ? AND "event_users"."event_id" = ? LIMIT ?  [["user_id", 11], ["event_id", 16], ["LIMIT", 1]]
---
					@event_user = EventUser.new(user_id: user.id, event_id: params[:event_id])
					# create a new join table record
					EventUser.transaction do
						@event_user.save
					end
				else
					@event_user_join = EventUser.find_by user_id: @user_in_database.id, event_id: params[:event_id]

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "event_users".* FROM "event_users" WHERE "event_users"."event_id" = ? AND "event_users"."user_id" = ? LIMIT ?  [["event_id", 4], ["user_id", 10], ["LIMIT", 1]]
---
	def remove
		@event = Event.find(params[:event_id])
		@user = User.find(params[:id])
		@join = EventUser.find_by event_id: @event.id, user_id: @user.id